#+STARTUP: inlineimages
*** Ejemplo 2 - Definir una variable con set y asignarle una lista como valor
  #+BEGIN_SRC elisp :exports both
    ;; le asignamos a flower una lista
    ;; 'flower es una variable
    ;; y '(rosa violeta) es una lista con dos elementos
    (set 'flowers '(rosa violeta))

    ;; hacemos que retorne la lista que tiene la variable flowers
    flowers
  #+END_SRC

  #+RESULTS:
  | rosa | violeta |
*** Ejemplo 3 - Definir una variable con setq y asignarle una lista como valor
  #+BEGIN_SRC elisp :exports both
    ;; la q de setq hace referencia a quote osea cita
    ;; por tanto no es necesario citar el primer argumento carnivores con el apóstrofe
    ;;
    ;; mientras que con set solo, si habria que citar el primer argumento con el apóstrofe
    (setq carnivores '(lion tiger leopard))
    carnivores
  #+END_SRC

  #+RESULTS:
  | lion | tiger | leopard |
*** Ejemplo 4 - Declarando e inicializando multiples variables con setq
  #+BEGIN_SRC elisp :exports both
    ;; con setq podemos hacer multiples asignaciones
    (setq nombre "carlitos" edad 19)

    ;; usamos message para imprimir
    ;; usando los especificadore de formato %s (para string)
    ;; y %d (para constantes numéricas enteras)
    (message "su nombre es %s y su edad es %d" nombre edadd)
  #+END_SRC

  #+RESULTS:
  : su nombre es carlitos y su edad es 19

*** Ejemplo 5 - Declarando e inicializando multiples variables con setq
  #+BEGIN_SRC elisp :exports both
    ;; con setq podemos hacer multiples asignaciones
    ;; en este caso a carnivores una lista
    ;; y a hervivores otra lista
    (setq carnivoros '(lion tiger leopard)
          hervivoros '(gacela cebra))

    carnivoros
    hervivoros
  #+END_SRC

  #+RESULTS:
  | gacela | cebra |
*** Ejemplo 6 - Usar una variable como contador e incrementar su valor en 1
  #+BEGIN_SRC elisp :exports both
    ; declaramos la variable `contador' y la inicializamos en 0
    ; declaramos la variable `contador' e inicializamos en cero
    (setq contador 0)

    ; - incrementamos el valor actual en 1 usando la función para sumar (+ x y)
    ; - cada vez que hagamos `C-x C-e' incrementará en 1 la variable `contador'
    (setq contador (+ contador 1))

    ; imprimimos su valor
    contador
  #+END_SRC

  #+RESULTS:
  : 1
*** Ejemplo 1 - Definimos dos variables locales al scope de let
  #+BEGIN_SRC elisp :exports both
    ;; let lleva como primer argumento una lista de clave-valor ((variableA valor) (variableB valor))
    ;; como segundo argumento un cuerpo de la función
    (let ((a "Soy a")(b "y yo soy b"))
      (message "Hi, %s. Hi %s" a b))
  #+END_SRC

  #+RESULTS:
  : Hello, I'm a. Hello I'm b
*** TODO Ejemplo 3
  #+BEGIN_SRC elisp :exports both
    ;; definimos una función que no recibe parámetros,
    ;; e imprime en el minibuffer el valor de `c'
    (defun funcion-loca ()
      (message "El valor de `c' es %s" c))

    (defvar c "tururu..")

    ;; Vemos que el valor de `c' no será el de arriba
    (let ((a "String de una variable local") (c "Sobreescribo la variable externa"))
      (funcion-loca)
      (message "El valor de `a' es: %s, y el de `c' es %s" a c))
  #+END_SRC

  #+RESULTS:
  : El valor de ‘a’ es: String de una variable local, y el de ‘c’ es Sobreescribo la variable externa
*** Ejemplo 4 - Variables con datos del buffer actual
  #+BEGIN_SRC elisp :exports both
    ;; let tiene una lista de clave-valor ((nombre1 valor1) (nombre2 valor2))
    ;; "en este caso valor1 y valor2 son funciones que retoran datos del buffer actual"
    ;; seguido de un cuerpo que es (message )
    (let ((foo (buffer-name)) (bar (buffer-size)))
      (message "Este buffer es %s y tiene %d caracteres." foo bar))
  #+END_SRC

  #+RESULTS:
  : Este buffer es README.org y tiene 12632 caracteres.
